## Plan Result (demo_frontendappgateway - TerraformPlanApply)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw"
        name                              = "cft-aks-fe-00-demo-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.221",
              + "10.50.95.221",
            ]
          + name         = "sscs-iba"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/ac-int-gateway-ccd" -> null
          - name                                = "ac-int-gateway-ccd" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/ac-int-gateway-ccd" -> null
          - probe_name                          = "ac-int-gateway-ccd" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/adoption-web" -> null
          - name                                = "adoption-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/adoption-web" -> null
          - probe_name                          = "adoption-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/bar" -> null
          - name                                = "bar" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/bar" -> null
          - probe_name                          = "bar" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/bar-int" -> null
          - name                                = "bar-int" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/bar-int" -> null
          - probe_name                          = "bar-int" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/cft-api-mgmt" -> null
          - name                                = "cft-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/cft-api-mgmt" -> null
          - probe_name                          = "cft-api-mgmt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/civil-citizen-ui" -> null
          - name                                = "civil-citizen-ui" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/civil-citizen-ui" -> null
          - probe_name                          = "civil-citizen-ui" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/cmc" -> null
          - name                                = "cmc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/cmc" -> null
          - probe_name                          = "cmc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/cui-ra" -> null
          - name                                = "cui-ra" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/cui-ra" -> null
          - probe_name                          = "cui-ra" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/div-da" -> null
          - name                                = "div-da" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/div-da" -> null
          - probe_name                          = "div-da" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/div-dn" -> null
          - name                                = "div-dn" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/div-dn" -> null
          - probe_name                          = "div-dn" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/div-pfe" -> null
          - name                                = "div-pfe" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/div-pfe" -> null
          - probe_name                          = "div-pfe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/div-rfe" -> null
          - name                                = "div-rfe" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/div-rfe" -> null
          - probe_name                          = "div-rfe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/dss" -> null
          - name                                = "dss" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/dss" -> null
          - probe_name                          = "dss" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/dss-update-case" -> null
          - name                                = "dss-update-case" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/dss-update-case" -> null
          - probe_name                          = "dss-update-case" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/em-icp" -> null
          - name                                = "em-icp" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/em-icp" -> null
          - probe_name                          = "em-icp" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/et-pet-admin" -> null
          - name                                = "et-pet-admin" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/et-pet-admin" -> null
          - probe_name                          = "et-pet-admin" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/backendHttpSettingsCollection/et-pet-et1" -> null
          - name                                = "et-pet-et1" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw/probes/et-pet-et1" -> null
          - probe_name                          = "et-pet-et1" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-de

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ame  = "idam-user-dashboard"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "idam-user-dashboard"
          + id                          = (known after apply)
          + name                        = "idam-user-dashboard"
          + priority                    = 450
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "idam-web-public"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "idam-web-public"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "idam-web-public"
          + id                          = (known after apply)
          + name                        = "idam-web-public"
          + priority                    = 480
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "judicial-payments"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "judicial-payments"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "judicial-payments"
          + id                          = (known after apply)
          + name                        = "judicial-payments"
          + priority                    = 710
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "return-case-doc-ccd"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "return-case-doc-ccd"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "return-case-doc-ccd"
          + id                          = (known after apply)
          + name                        = "return-case-doc-ccd"
          + priority                    = 510
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "return-case-doc-ccd-int"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "return-case-doc-ccd-int"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "return-case-doc-ccd-int"
          + id                          = (known after apply)
          + name                        = "return-case-doc-ccd-int"
          + priority                    = 520
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "sscs-iba"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "sscs-iba"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "sscs-iba"
          + id                          = (known after apply)
          + name                        = "sscs-iba"
          + priority                    = 430
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "tax-tribunals-datacapture"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "tax-tribunals-datacapture"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "tax-tribunals-datacapture"
          + id                          = (known after apply)
          + name                        = "tax-tribunals-datacapture"
          + priority                    = 680
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-approve-org"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-approve-org"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-approve-org"
          + id                          = (known after apply)
          + name                        = "xui-approve-org"
          + priority                    = 580
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-approve-org-int"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-approve-org-int"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-approve-org-int"
          + id                          = (known after apply)
          + name                        = "xui-approve-org-int"
          + priority                    = 460
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-manage-org"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-manage-org"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-manage-org"
          + id                          = (known after apply)
          + name                        = "xui-manage-org"
          + priority                    = 590
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-manage-org-int"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-manage-org-int"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-manage-org-int"
          + id                          = (known after apply)
          + name                        = "xui-manage-org-int"
          + priority                    = 470
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-register-org"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-register-org"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-register-org"
          + id                          = (known after apply)
          + name                        = "xui-register-org"
          + priority                    = 570
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp"
          + id                          = (known after apply)
          + name                        = "xui-webapp"
          + priority                    = 620
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp-ac-int"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp-ac-int"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp-ac-int"
          + id                          = (known after apply)
          + name                        = "xui-webapp-ac-int"
          + priority                    = 530
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp-caa-ac"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp-caa-ac"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp-caa-ac"
          + id                          = (known after apply)
          + name                        = "xui-webapp-caa-ac"
          + priority                    = 550
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp-hearings-int"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp-hearings-int"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp-hearings-int"
          + id                          = (known after apply)
          + name                        = "xui-webapp-hearings-int"
          + priority                    = 560
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp-int"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp-int"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp-int"
          + id                          = (known after apply)
          + name                        = "xui-webapp-int"
          + priority                    = 540
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp-int1"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp-int1"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp-int1"
          + id                          = (known after apply)
          + name                        = "xui-webapp-int1"
          + priority                    = 600
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp-int2"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp-int2"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp-int2"
          + id                          = (known after apply)
          + name                        = "xui-webapp-int2"
          + priority                    = 610
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp-srt"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp-srt"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp-srt"
          + id                          = (known after apply)
          + name                        = "xui-webapp-srt"
          + priority                    = 630
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp-wa-int"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp-wa-int"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp-wa-int"
          + id                          = (known after apply)
          + name                        = "xui-webapp-wa-int"
          + priority                    = 640
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (81 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-demo-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label demo_frontendappgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/2277/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":2277,"Program":"tfcmt","SHA1":"","Target":"demo_frontendappgateway - TerraformPlanApply","Vars":{}} -->